{
  "ethernaut": "Ethernaut",
  "title": "The Ethernaut",
  "hiring": "Contratamos",
  "info": "<h2>The Ethernaut es un juego basado en Web3/Solidity inspirado por <a href='https://overthewire.org' target='_blank' rel='noopener noreferrer'>overthewire.org</a>, funcionando en la Ethereum Virtual Machine. Cada nivel es un smart contract que el jugador necesita hackear. El juego es 100% de código abierto y todos los niveles son contribuciones hechas por otros jugadores. ¿Tienes una idea interesante? Cualquier sugerencia es <a href='https://github.com/OpenZeppelin/ethernaut'><button>Bienvenida</button></a></h2>",
  "home": "Inicio",
  "help": "Ayuda",
  "stats": "Estadísticas",
  "ethernautHelp": "Ayuda",
  "footer": "desarrollado con <span aria-hidden='true' class='fa fa-heart' style='color: red;'></span> y <span aria-hidden='true' class='fa fa-flash' style='color: yellow;'></span> por el equipo de <a href='https://openzeppelin.com'>OpenZeppelin</a>",
  "english": "English",
  "arabic": "عربي",
  "spanish": "Español",
  "japanese": "日本語",
  "turkish": "Türkçe",
  "chinese_simplified": "簡體中文",
  "chinese_traditional": "正體中文",
  "french": "Français",
  "russian": "Русский",
  "playNow": "Juega ahora!",
  "toggleNavigation": "Despliega la navegación",
  "levelCompleted": "Nivel completado!",
  "sources": "Código",
  "submitInstance": "Comprueba instancia",
  "getNewInstance": "Nueva instancia",
  "deployMessageTitle": "Juego no desplegado",
  "deployMessage": "Actualmente, el juego solo es compatible con estas redes.:",
  "deployConfirmation": "¿Quieres implementar los contratos en esta red o cambiar a la red Goerli?",
  "deployNote": "Nota: si implementa todos los niveles, lo guiaremos para que envíe todo el juego implementado en esta red.",
  "deployGame": "Desplegar juego",
  "switchToGoerli": "Cambiar a Goerli",
  "deployLevel": "Nivel de implementación",
  "helperDeployAllContracts": "Implemente todos los contratos restantes en la red actual.",
  "confirmMainnetDeploy": "Estás en una red principal, el juego no tiene valor monetario, no debes implementarlo en esta red.",
  "submitLevelFooter": "Implemente todos los niveles (deployAllContracts() en la consola) para agregar la red actual a nuestro <a href='https://github.com/OpenZeppelin/ethernaut'>repositorio de Github</a> como una nueva red compatible.",
  "submitGameFooter": "¡Impresionante! Todo el juego se implementa en esta red. Haga clic aquí para plantear un problema de GitHub y enviarlo :)",
  "nextLevel": "Pasa al siguiente nivel",
  "uLevels": "Niveles",
  "lLevels": "niveles",
  "refresh": "Carga de nuevo",
  "uCompleted": "Completado",
  "lCompleted": "completados",
  "players": "jugadores",
  "player": "Jugador",
  "levelName": "Nombre del nivel",
  "levelAddress": "Dirección del nivel",
  "blockNum": "Número del bloque",
  "uCreated": "Creado",
  "lCreated": "creados",
  "instance": "Instancia",
  "numberOf": "Número de",
  "warning": "Advertencia",
  "warningMessage": "No hay proveedor web3 y el juego está en modo de solo lectura",
  "levelAuthor": "Autor del nivel:",
  "pleaseWait": "POR FAVOR, ESPERE",
  "donate": "Has aprendido algo útil en ese nivel? Manda una donación al autor del nivel (en mainnet):",
  "openConsole": "ABRE LA CONSOLA PARA JUGAR",
  "difficulty": "Dificultad",
  "error": "Error",
  "retrying": "intentando de nuevo...",
  "typeHelpMessage": "Escriba help() para obtener una lista de objetos web3 personalizados",
  "slowNetworkMessage": "Recibes mensajes molestos del tipo 'Slow network detected'? Prueba en los ajustes 'Dev Tool -> User messages only' o deshabilita 'chrome://flags/#enable-webfonts-intervention-v2'",
  "notContractSetMessage": "Ningún contrato seteado, ve a un nivel y haga clic en 'Nueva instancia'",
  "levelAddressMessage": "Dirección del nivel",
  "instanceAddressMessage": "Dirección de la instancia",
  "playerAddressMessage": "Dirección del jugador",
  "selectedNetworkMessage": "Current network: ",
  "ethernautAddressMessage": "Dirección de Ethernaut",
  "noLevelsDataMessage": "No se encuentran los datos de los niveles",
  "ethernautNotFoundMessage": "El contrato de Ethernaut no se ha encontrado en la red seleccionada. Por favor averigua que 1) Estás usando MetaMask, 2) Estas en una red soportada, 3) Que MetaMask esté desbloqueado, 4 opcional) Puedes habilitar y setear en ON el modo privado (desactivado por defecto) en los ajustes si no quieres que tus informaciones sean automáticamente expuestas. 5 opcional) Si el modo privado esta habilitado tienes que autorizar MetaMask a utilizar esta página web. 6) Actualiza la página.",
  "requestingNewInstanceMessage": "Obteniendo nueva instancia del nivel...",
  "unableToRetrieveLevelMessage": "No se puede obtener la instancia del nivel! Por favor, controle la cantidad de gas proporcionada e inténtelo de nuevo.",
  "transactionNoLogsMessage": "La transacción no contiene logs",
  "noPlayerAddressMessage": "Ninguna dirección encontrada para el jugador! Asegúrate de que 1) Tengas instalada la extensión MetaMask para tu navegador y 2) Que esté desbloqueada. 3 opcional) Puedes habilitar y setear en ON el modo privado (desactivado por defecto) en los ajustes si no quieres que tus informaciones sean automáticamente expuestas. 4 opcional) Si el modo privado esta habilitado tienes que autorizar MetaMask a utilizar esta página web. 5) Actualiza la página.",
  "noEthersMessage": "Yikes, you have no ether! Get some at valid faucet for your chosen network",
  "submitLevelMessage": "Enviando la instancia del nivel",
  "wellDoneMessage": "Bien hecho",
  "completedLevelMessage": "Has completado ese nivel!!!",
  "uncompletedLevelMessage": "Ups, parece que todavía no has hackeado este nivel",
  "metamaskKnownIssue": "Ouch! Parece que has encontrado un error conocido de MetaMask. Intenta desactivar en reactivar la extensión, y si no funciona, intenta cerrar todos los procesos del navegador y reiniciar, hasta que no se publique una solución. No te preocupes, después de reiniciar no deberías volver a ver ese mensaje.",
  "eventsCompletionMessage": "Error mirando la terminación de los eventos:",
  "unexpectedAddressMessage": "Dirección inesperada en el evento LevelCompletedLog (saltando al siguiente):",
  "helperPlayer": "dirección del jugador actual",
  "helperEthernaut": "el principal contrato del juego",
  "helperLevel": "dirección del contrato del nivel actual",
  "helperContract": "instancia del nivel actual (si ha sido creada)",
  "helperInstance": "dirección del contrato de la instancia actual (si ha sido creado)",
  "helperVersion": "versión del juego actual",
  "helperGetBalance": "obtén el balance en ether",
  "helperGetBlockNumber": "obtén el número de bloque actual",
  "helperSendTransaction": "herramienta para el envío de transacciones",
  "helperGetNetworkId": "obtén el identificador de la red",
  "helperToWei": "convierte ether en wei",
  "helperFromWei": "convierte wei en ether",
  "levelNotTranslated": "Este nivel no está traducido o la traducción es incompleta. ",
  "contributeTranslation": "Haz clic aquí para contribuir en mejorar la traducción",
  "usingConsole": "Most game interaction is via the browser's console: `Dev Tools -> Console`. Open the console and enter the command: \n\n`help()`\n\n to see a list of objects and functions injected by the game to the console. Since most interactions are asynchronous, we recommend using Chrome v62 which enables the `async`/`await` keywords in the console, so instead of writting:\n\n`getBalance(player)> PROMISE`\n\nand opening the promise. With await/async, you can write:\n\n`await getBalance(player) > '1.11002387' `\n\n",
  "gameMechanics": "The game uses the main contract `Ethernaut.sol` to manage player progress and delegate interaction with `Level.sol` implementations. Each level contract emits instances for players to manipulate, break, destroy, fix, etc. The player requests an instance, manipulates it and returns it to the game for evaluation of level completion.\n\n Both requesting instances and submitting instances back to the game are done with the buttons in the user interface in each level. When this app retrieves an instance from `Ethernaut.sol`, it wraps it in a `TruffleContract` object and exposes it in the browser's console. See the first level for a full tutorial on how to play the game.",
  "beyondConsole": "Some levels will require working outside of the browser console. That is, writing solidity code and deploying it in the network to attack the level's instance contract with another contract. This can be done in multiple ways, for example: \n\n1) Use Remix to write the code and deploy it in the corresponding network See [Remix Solidity IDE](https://remix.ethereum.org/).\n\n 2) Setup a local truffle project to develop and deploy the attack contracts. See [Truffle Framework](http://truffleframework.com/).",
  "troubleshooting": "Sometimes \n\n(a) the app state or (b) the MetaMask plugin state \n\ncan become a bit messed up, specially after switching networks, unlocking, etc. If what you're seeing doesn't make much sense, try refreshing the app, hard-refreshing it, disabling and re-enabling your metamask plugin or even restarting your browser. \n\nIf you find issues, please let us know at ethernaut@zeppelin.solutions",
  "poweredBy": "powered by ",
  "setupMetamask": "Si aún no lo tienes, instala la [extensión del navegador MetaMask](https://metamask.io/). \n\nConfigura la billetera de la extensión y usa el selector de red para apuntar a tu red preferida en la parte superior izquierda de la interfaz de la extensión. De forma alternativa, puedes usar el boton en la interfaz de usuario para cambiar entre diferentes redes. Si seleccionas una red no soportada, el juego te notificarà y llevarà a la red de test por defecto de Goerli.  \n\nUna vez hecho, vuelve aqui y vuelve a carga la pagin"
}