{
  "ethernaut": "Ethernaut",
  "title": "Ethernaut",
  "hiring": "Estamos contratando!",
  "info": "<h2>O Ethernaut é um jogo baseado em Web3/Solidity inspirado no <a href='https://overthewire.org' target='_blank' rel='noopener noreferrer'>overthewire.org</a>, jogado na Ethereum Virtual Machine. Cada nível é um contrato inteligente que precisa ser 'hackeado'. O jogo é 100% de código aberto e todos os níveis são contribuições feitas por outros jogadores. Você tem uma ideia interessante? PRs são <a href='https://github.com/OpenZeppelin/ethernaut'><button>Bem Vindos</button></a></h2>",
  "home": "Home",
  "help": "Ajuda",
  "stats": "Estatísticas",
  "ethernautHelp": "Ajuda",
  "footer": "Desenvolvido com <span aria-hidden='true' class='fa fa-heart' style='color: red;'></span> e <span aria-hidden='true' class='fa fa-flash' style='color: yellow;'></span> pelo time <a href='https://openzeppelin.com'>OpenZeppelin</a>",
  "english": "English",
  "arabic": "عربي",
  "spanish": "Español",
  "portuguese": "Português",
  "japanese": "日本語",
  "turkish": "Türkçe",
  "chinese_simplified": "簡體中文",
  "chinese_traditional": "正體中文",
  "french": "Français",
  "russian": "Русский",
  "playNow": "Jogue agora!",
  "toggleNavigation": "Exibir a navegação",
  "levelCompleted": "Nível completado!",
  "sources": "Código",
  "submitInstance": "Enviar instância",
  "getNewInstance": "Obter nova instância",
  "nextLevel": "Vá para o próximo nível",
  "uLevels": "Níveis",
  "lLevels": "níveis",
  "refresh": "Atualizar",
  "uCompleted": "Completado",
  "lCompleted": "completado",
  "players": "jogadores",
  "player": "Jogador",
  "levelName": "Nome do nível",
  "levelAddress": "Endereço do nível",
  "blockNum": "Número do bloco",
  "uCreated": "Criado",
  "lCreated": "criado",
  "instance": "Instância",
  "numberOf": "Número de ",
  "levelAuthor": "Autor(es) do nível:",
  "pleaseWait": "POR FAVOR, AGUARDE",
  "donate": "Esse nível te ensinou algo útil? Doe para o autor do nível (na mainnet):",
  "openConsole": "ABRA O CONSOLE PARA JOGAR",
  "difficulty": "Dificuldade",
  "error": "Erro",
  "retrying": "tentando novamente...",
  "typeHelpMessage": "Digite help() para obter uma lista de objetos web3 personalizados",
  "slowNetworkMessage": "Está recebendo mensagens irritantes como 'Slow network detected'? Tente nos ajustes 'Dev Tool -> User messages only' ou desabilitar 'chrome://flags/#enable-webfonts-intervention-v2'",
  "notContractSetMessage": "Nenhum contrato definido, vá para um nível e clique em 'Obter nova instância'",
  "levelAddressMessage": "Endereço do nível",
  "instanceAddressMessage": "Endereço da instância",
  "playerAddressMessage": "Endereço do jogador",
  "selectedNetworkMessage": "Rede atual: ",
  "ethernautAddressMessage": "Endereço do Ethernet",
  "noLevelsDataMessage": "Dados dos níveis não encontrados",
  "ethernautNotFoundMessage": "O contrato do Ethernaut não foi encontrado na rede atual. Por favor, certifique-se (1) que você está usando o metamask, (2) que está em uma rede suportada, (3) que o metamask está desbloqueado, (4 opcional) A partir de 2 de novembro, você pode ativar o modo de privacidade (desativado por padrão) nas configurações do Metamask se não quiser expor suas informações por padrão. (5 opcional) Se o modo de privacidade estiver ativado, você tem que autorizar o metamask para usar esta página. (6) Atualize a página.",
  "requestingNewInstanceMessage": "Solicitando nova instância do nível...",
  "unableToRetrieveLevelMessage": "Não foi possível obter a instância do nível! Verifique a quantidade de gas e tente novamente..",
  "transactionNoLogsMessage": "A transação não contém logs",
  "noPlayerAddressMessage": "Nenhum endereço de jogador detectado! Certifique-se de que 1) Você instalou a extensão do metamask no seu navegador e 2) que está desbloqueado. 3 opcional) A partir de 2 de novembro, você pode ativar o modo de privacidade (desativado por padrão) nas configurações se não quiser expor suas informações por padrão. 4 opcional) Se o modo de privacidade estiver ativado, você tem que autorizar o metamask para usar esta página. 5) Atualize a página.",
  "noEthersMessage": "Oops, você não tem ether! Obtenha alguns em uma faucet válida para a rede que você escolheu",
  "submitLevelMessage": "Enviando a instância do nível...",
  "wellDoneMessage": "Muito bem",
  "completedLevelMessage": "Você completou este nível!!!",
  "uncompletedLevelMessage": "Oops! Parece que você ainda não conseguiu hackear esse nível",
  "metamaskKnownIssue": "Ouch! Parece que você se deparou com um problema conhecido do Metamask. Tente desativar e reativar sua extensão metamask, e se isso não funcionar, Infelizmente, você precisará fechar todos os processos do Chrome e reiniciar para contornar isso, até que uma correção seja lançada. Não se preocupe, depois de reiniciar você não verá esta mensagem novamente.",
  "eventsCompletionMessage": "Erro ao olhar para a conclusão dos eventos:",
  "unexpectedAddressMessage": "Endereço inesperado no evento LevelCompletedLog (ignorando):",
  "helperPlayer": "endereço atual do jogador",
  "helperEthernaut": "contrato principal do jogo",
  "helperLevel": "endereço do contrato do nível atual",
  "helperContract": "instância do contrato do nível atual (se criada)",
  "helperInstance": "endereço do contrato da instância do nível atual (se criado)",
  "helperVersion": "versão atual do jogo",
  "helperGetBalance": "obtém o saldo do endereço em ether",
  "helperGetBlockNumber": "obtém o número do bloco da rede atual",
  "helperSendTransaction": "ferramenta de envio de transações",
  "helperGetNetworkId": "obtém o id da rede ethereum",
  "helperToWei": "converte ether para wei",
  "helperFromWei": "converte wei para ether",
  "levelNotTranslated": "Este nível não está traduzido ou a tradução está incompleta. ",
  "contributeTranslation": "Clique aqui para melhorar a tradução",
  "usingConsole": "A maior parte da interação do jogo é através do console do navegador: `Dev Tools -> Console`. Abra o console e digite o comando: \n\n`help()`\n\n para ver uma lista de objetos e funções injetados pelo jogo no console. Como a maioria das interações é assíncrona, recomendamos o uso do Chrome v62, que permite as palavras-chave `async/await` no console, então ao invés de escrever: \n\n`getBalance(player)> PROMISE`\n\n e abrir a promise. Utilizando a sintaxe await/async, você pode escrever:\n\n`await getBalance(player) > '1.11002387' `\n\n",
  "gameMechanics": "O jogo usa o contrato principal `Ethernaut.sol` para gerenciar o progresso do jogador e delegar a interação com as implementações `Level.sol`. Cada contrato do nível emite instâncias para os jogadores manipularem, quebrarem, destruirem, consertarem, etc. O jogador solicita uma instância, manipula-a e devolve-a ao jogo para avaliação da conclusão do nível.\n\n Tanto a solicitação de instâncias quanto o envio de instâncias de volta ao jogo são feitos com os botões na interface do usuário em cada nível. Quando o aplicativo recupera uma instância do `Ethernaut.sol`, ele a envolve em um objeto `TruffleContract` e a expõe no console do navegador. Veja o primeiro nível para um tutorial completo sobre como jogar o jogo.",
  "beyondConsole": "Alguns níveis exigirão trabalho fora do console do navegador. Isto é, escrever código solidity e fazer o deploy na rede para atacar o contrato da instância do nível com outro contrato. Isso pode ser feito de várias maneiras, por exemplo: \n\n1) Use o Remix para escrever o código e fazer o deploy na rede correspondente, Veja [Remix Solidity IDE](https://remix.ethereum.org/). \n\n2) Configure um projeto truffle local para desenvolver e fazer o deploy dos contratos de ataque. Veja [Truffle Framework](http://truffleframework.com/).",
  "troubleshooting": "Às vezes \n\n(a) o estado do aplicativo ou (b) o estado do plugin do MetaMask \n\npode ficar um pouco confuso, especialmente depois de trocar de rede, desbloquear, etc. Se o que você está vendo não faz muito sentido, tente atualizar o aplicativo, desabilitar e habilitar seu plugin metamask ou até mesmo reiniciar seu navegador. \n\nSe você encontrar problemas, por favor nos informe em ethernaut@zeppelin.solutions",
  "poweredBy": "powered by ",
  "setupMetamask": "Se você ainda não tem, instale o [MetaMask browser extension](https://metamask.io/) (no Chrome, Firefox, Brave ou Opera em seu computador). \n\nConfigure a carteira da extensão e use o seletor de rede para apontar para a rede preferida no canto superior esquerdo da interface da extensão. Alternativamente, você pode usar o botão para alternar entre as redes. Se você selecionar uma rede não suportada, o jogo irá notificá-lo e levá-lo para o Goerli testnet padrão. \n\nUma vez feito, volte aqui e recarregue a página"
}
