{
  "ethernaut": "Ethernaut",
  "title": "Ethernaut",
  "hiring": "Chung tôi đang cần tuyển dụng!",
  "ctfRegister": "Đăng ký ngay!",
  "ctfInfo": "<strong>Chúng tôi đang tổ chức Ethernaut CTF:</strong> Sự kiện bắt cờ 48 giờ với giải thưởng và thử thách blockchain, bắt đầu từ 16/03.",
  "info": "<h2>Ethernaut là một trò chơi lập trình sử dụng Web3/Solidity lấy cảm hứng từ <a href='https://overthewire.org' target='_blank' rel='noopener noreferrer'>overthewire.org</a>, được chơi trong Máy ảo Ethereum. Mỗi cấp độ là một hợp đồng thông minh cần được “hack”. 100% trò chơi là mã nguồn mở và tất cả các cấp độ đều được đóng góp bởi những người chơi khác. Bạn có ý tưởng muốn đóng góp? Mọi PR đều được <a href='https://github.com/OpenZeppelin/ethernaut'><button>Hoan Nghênh</button></a></h2>",
  "home": "Trang chủ",
  "help": "Trợ giúp",
  "stats": "Thống kê",
  "ethernautHelp": "Trợ giúp",
  "footer": "được phát triển với <span aria-hidden='true' class='fa fa-heart' style='color: red;'></span> và <span aria-hidden='true' class='fa fa-flash' style='color: yellow;'></span> bởi đội ngũ <a href='https://openzeppelin.com'>OpenZeppelin</a>",
  "english": "English",
  "arabic": "عربي",
  "spanish": "Español",
  "ukrainian": "Українська",
  "portuguese": "Português",
  "japanese": "日本語",
  "turkish": "Türkçe",
  "chinese_simplified": "簡體中文",
  "chinese_traditional": "正體中文",
  "french": "Français",
  "russian": "Русский",
  "vietnamese": "tiếng Việt",
  "korean": "한국어",
  "playNow": "Bắt đầu!",
  "toggleNavigation": "Bật tắt điều hướng",
  "levelCompleted": "Hoàn thành!",
  "sources": "Nguồn",
  "submitInstance": "Nộp bài",
  "getNewInstance": "Tạo phiên bản mới",
  "accountNotConnectedTitle": "Tài khoản MetaMask chưa được kết nối",
  "accountNotConnectedMessage": "Để bắt đầu hành trình, hãy kết nối ví MetaMask của bạn! Trò chơi tương tác trực tiếp với các hợp đồng Ethernaut on-chain, nghĩa là mọi hành động của bạn trong game đều được ghi lại trên blockchain. Bằng cách liên kết tài khoản MetaMask, bạn có thể tương tác an toàn với các hợp đồng thông minh này, giải các thử thách và tiến bộ trong trò chơi.",
  "connectAccount": "Kết nối",
  "deployMessageTitle": "Trò chơi chưa được triển khai",
  "deprecatedNetwork": "Mạng đã bị ngừng hỗ trợ",
  "networkBeingDeprecated": "Mạng đang bị ngừng hỗ trợ",
  "deployMessage": "Hiện tại game chỉ hỗ trợ các mạng này:",
  "deployConfirmation": "Bạn muốn triển khai các hợp đồng trên mạng này hay chuyển sang mạng Sepolia?",
  "deployNote": "Lưu ý: Nếu bạn triển khai tất cả các cấp độ, chúng tôi sẽ hướng dẫn bạn gửi toàn bộ trò chơi đã triển khai trên mạng này.",
  "deployGame": "Triển khai trò chơi",
  "switchToSepolia": "Chuyển sang Sepolia",
  "continueAnyway": "Vẫn tiếp tục",
  "deployLevel": "Triển khai cấp độ",
  "helperDeployAllContracts": "Triển khai tất cả các hợp đồng còn lại trên mạng hiện tại.",
  "confirmMainnetDeploy": "Bạn đang ở trên mạng chính, trò chơi không có giá trị tiền tệ, bạn không nên triển khai trên mạng này.",
  "submitLevelFooter": "Triển khai tất cả các cấp độ (deployAllContracts() in console) để thêm mạng hiện tại vào <a href='https://github.com/OpenZeppelin/ethernaut'>Github repository</a> dưới dạng mạng được hỗ trợ mới.",
  "submitGameFooter": "Tuyệt vời! Toàn bộ trò chơi được triển khai trên mạng này. Nhấp vào đây để tạo vấn đề GitHub và gửi cho chúng tôi :)",
  "nextLevel": "Đi đến cấp độ tiếp theo",
  "uLevels": "Cấp độ",
  "lLevels": "cấp độ",
  "refresh": "Làm mới",
  "uCompleted": "Hoàn thành",
  "lCompleted": "hoàn thành",
  "players": "người chơi",
  "player": "Người chơi",
  "levelName": "Tên cấp độ",
  "levelAddress": "Địa chỉ của cấp độ",
  "blockNum": "Số khối",
  "uCreated": "Tạo",
  "lCreated": "tạo",
  "instance": "Phiên bản",
  "numberOf": "Số lượng",
  "warning": "Cảnh báo",
  "warningMessage": "Không có nhà cung cấp Web3 và trò chơi ở chế độ chỉ đọc",
  "levelAuthor": "Cấp độ tác giả:",
  "pleaseWait": "VUI LÒNG CHỜ",
  "donate": "Bài tập này có dạy cho bạn điều gì hữu ích không? Đóng góp cho tác giả của bài tập (trên mainnet):",
  "openConsole": "MỞ CONSOLE CỦA BẠN ĐỂ CHƠI",
  "difficulty": "Độ khó",
  "error": "Lỗi",
  "retrying": "thử lại...",
  "typeHelpMessage": "Nhập help() để có danh sách các tiện ích bổ sung web3 tùy chỉnh",
  "slowNetworkMessage": "Thông báo 'Phát hiện mạng chậm' gây khó chịu? Hãy thử cài đặt Công cụ dành cho nhà phát triển -> Chỉ tin nhắn của người dùng hoặc tắt 'chrome://flags/#enable-webfonts-intervention-v2",
  "notContractSetMessage": "Không có hợp đồng nào được sử dụng, hãy chuyển đến một cấp độ và nhấp vào 'Tạo phiên bản mới'",
  "levelAddressMessage": "Địa chỉ cấp độ",
  "instanceAddressMessage": "Địa chỉ phiên bản",
  "playerAddressMessage": "Địa chỉ người chơi",
  "selectedNetworkMessage": "Mạng hiện tại: ",
  "ethernautAddressMessage": "Địa chỉ Ethernaut",
  "noLevelsDataMessage": "Không thể tìm thấy dữ liệu cấp độ",
  "ethernautNotFoundMessage": "Hợp đồng Ethernaut không được tìm thấy trong mạng hiện tại. Vui lòng đảm bảo (1) rằng bạn đang sử dụng metamask, (2) nó nằm trên mạng được hỗ trợ, (3) nó đã được mở khóa, (4 tùy chọn) Từ ngày 2 tháng 11, bạn có thể BẬT chế độ bảo mật (TẮT theo mặc định) trong Metamask cài đặt nếu bạn không muốn hiển thị thông tin của mình theo mặc định. (5 tùy chọn) Nếu chế độ bảo mật được BẬT, bạn phải ủy quyền cho siêu mặt nạ để sử dụng trang này. và (6) sau đó làm mới.",
  "requestingNewInstanceMessage": "Yêu cầu hợp đồng mới từ bài tập...",
  "unableToRetrieveLevelMessage": "Không thể tạo được hợp đồng mới cho bài tập! Hãy kiểm tra gas và thử lại lần nữa.",
  "transactionNoLogsMessage": "Giao dịch không được lưu lại",
  "noPlayerAddressMessage": "Không có địa chỉ người chơi được phát hiện! Đảm bảo rằng 1) Bạn đã cài đặt tiện ích mở rộng trình duyệt metamask và 2) nó đã được mở khóa. 3 tùy chọn) Từ ngày 2 tháng 11, bạn có thể BẬT chế độ bảo mật (TẮT theo mặc định) trong cài đặt nếu bạn không muốn tiết lộ thông tin của mình theo mặc định. 4 tùy chọn) Nếu chế độ riêng tư được BẬT, bạn phải ủy quyền cho Metamask sử dụng trang này. 5) sau đó làm mới",
  "noEthersMessage": "Ôi, bạn không có ether! Hãy nhận một ít từ faucet hợp lệ cho mạng bạn chọn",
  "submitLevelMessage": "Nộp bài...",
  "wellDoneMessage": "Rất tốt",
  "completedLevelMessage": "Bạn đã hoàn thành cấp độ này!!!",
  "uncompletedLevelMessage": "Ối! Có vẻ như bạn chưa vượt qua được cấp độ này",
  "metamaskKnownIssue": "Ôi! Có vẻ như bạn đã gặp phải sự cố Metamask đã biết. Hãy thử tắt và bật lại plugin metamask của bạn. Nếu cách đó không hiệu quả, tôi e rằng bạn cần phải đóng tất cả các quy trình của Chrome và khởi động lại để xử lý plugin cho đến khi bản sửa lỗi được đưa ra. Đừng lo lắng, sau khi khởi động lại, bạn sẽ không thấy thông báo này nữa.",
  "eventsCompletionMessage": "Lỗi khi xem sự kiện hoàn thành:",
  "unexpectedAddressMessage": "Địa chỉ không mong đợi trong sự kiện LevelCompletedLog (bỏ qua):",
  "helperPlayer": "địa chỉ người chơi hiện tại",
  "helperEthernaut": "hợp đồng trò chơi chính",
  "helperLevel": "địa chỉ hợp đồng cấp hiện tại",
  "helperContract": "phiên bản hợp đồng cấp hiện tại (nếu được tạo)",
  "helperInstance": "địa chỉ hợp đồng cấp hiện tại (nếu được tạo)",
  "helperVersion": "phiên bản trò chơi hiện tại",
  "helperGetBalance": "lấy số dư địa chỉ trong ether",
  "helperGetBlockNumber": "lấy số khối mạng hiện tại",
  "helperSendTransaction": "gửi giao dịch",
  "helperGetNetworkId": "lấy id mạng ethereum",
  "helperToWei": "chuyển đổi đơn vị ether sang wei",
  "helperFromWei": "chuyển đổi đơn vị wei sang ether",
  "levelNotTranslated": "Cấp độ này chưa được dịch hoặc bản dịch chưa đầy đủ.",
  "contributeTranslation": "Bấm vào đây để cải thiện bản dịch",
  "usingConsole": "Hầu hết tương tác trò chơi đều thông qua bảng điều khiển của trình duyệt: `Dev Tools -> Console`. Mở bảng điều khiển và nhập lệnh: \n\n`help()`\n\n để xem danh sách các đối tượng và chức năng được trò chơi đưa vào bảng điều khiển. Vì hầu hết các tương tác đều không đồng bộ, chúng tôi khuyên bạn nên sử dụng Chrome v62 để bật từ khóa `async/await` trong bảng điều khiển, thay vì viết: \n\n`getBalance(player)> PROMISE`\n\n và mở lời hứa. Với chờ đợi/không đồng bộ, bạn có thể viết:\n\n`await getBalance(player) > '1.11002387' `\n\n",
  "gameMechanics": "Trò chơi sử dụng hợp đồng chính `Ethernaut.sol` để quản lý tiến trình của người chơi và ủy quyền tương tác với việc triển khai `Level.sol`. Mỗi hợp đồng cấp độ sẽ tạo ra các phiên bản để người chơi thao tác, phá vỡ, phá hủy, sửa chữa, v.v. Người chơi yêu cầu một phiên bản, thao túng nó và trả lại nó cho trò chơi để đánh giá mức độ hoàn thành cấp độ.\n\n Cả hai yêu cầu phiên bản và gửi lại phiên bản vào trò chơi được thực hiện bằng các nút trong giao diện người dùng ở mỗi cấp độ. Khi ứng dụng này truy xuất một phiên bản từ `Ethernaut.sol`, nó sẽ gói phiên bản đó trong một đối tượng `TruffleContract` và hiển thị phiên bản đó trong bảng điều khiển của trình duyệt. Xem cấp độ đầu tiên để có hướng dẫn đầy đủ về cách chơi trò chơi.",
  "beyondConsole": "Một số cấp độ sẽ yêu cầu làm việc bên ngoài bảng điều khiển trình duyệt. Tức là viết mã vững chắc và triển khai nó trong mạng để tấn công hợp đồng cá thể của cấp độ đó với một hợp đồng khác. Việc này có thể được thực hiện theo nhiều cách, ví dụ: \n\n1) Sử dụng Remix để viết mã và triển khai mã đó trong mạng tương ứng Xem [Remix Solidity IDE](https://remix.ethereum.org/). \n\n2) Thiết lập dự án truffle cục bộ để phát triển và triển khai các hợp đồng tấn công. Xem [Truffle Framework](http://truffleframework.com/).",
  "troubleshooting": "Đôi khi \n\n(a) trạng thái ứng dụng hoặc (b) trạng thái plugin MetaMask \n\ncó thể hơi rối, đặc biệt là sau khi chuyển mạng, mở khóa, v.v. Nếu những gì bạn đang thấy không có nhiều ý nghĩa , hãy thử làm mới ứng dụng, làm mới ứng dụng, tắt và bật lại plugin metamask hoặc thậm chí khởi động lại trình duyệt của bạn. \n\nNếu bạn gặp vấn đề, vui lòng cho chúng tôi biết theo địa chỉ ethernaut@zeppelin.solutions",
  "poweredBy": "được cung cấp bởi ",
  "setupMetamask": "Nếu bạn chưa có nó, hãy cài đặt [MetaMask browser extension](https://metamask.io/) (trong Chrome, Firefox, Brave hoặc Opera trên máy tính để bàn của bạn). \n\nThiết lập ví của tiện ích mở rộng và sử dụng bộ chọn mạng để trỏ đến mạng ưa thích ở phía trên bên trái giao diện của tiện ích mở rộng. Ngoài ra bạn có thể sử dụng nút UI để chuyển đổi giữa các mạng. Nếu bạn chọn mạng không được hỗ trợ, trò chơi sẽ thông báo cho bạn và đưa bạn đến mạng thử nghiệm Sepolia mặc định. \n\nSau khi hoàn tất, hãy quay lại đây và tải lại trang web",
  "FifthyPercentMessage": "Công việc tuyệt vời! Bạn đã đi được nửa chặng đường của Ethernaut và đang khá giỏi trong việc phá vỡ mọi thứ. Làm việc với tư cách là Nhà nghiên cứu bảo mật Blockchain tại OpenZeppelin có thể rất thú vị... https://grnh.se/fdbf1c043us",
  "SeventyFivePercentMessage": "75%: Làm tốt lắm…bây giờ bạn đang ở sâu trong hố thỏ…ai biết nó sẽ đưa bạn đến đâu… https://grnh.se/d4a786e43us",
  "NinetyPercentMessage": "90%: Bạn sắp đến đích rồi! Chỉ còn một vài thử thách nữa là bạn sẽ hoàn thành Ethernaut! Bạn đã cân nhắc sự nghiệp trong lĩnh vực Bảo mật Blockchain chưa?https://grnh.se/cfcca8c83us",
  "HundredPercentMessage": "100%: Xin chúc mừng! Cuộc hành trình của bạn xuống hố thỏ Web3 thật ấn tượng và đáng được tôn vinh! Bây giờ bạn có kỹ năng để phá vỡ hợp đồng thông minh! Điều gì tiếp theo từ đây? Đăng ký làm Nhà nghiên cứu bảo mật Blockchain tại OpenZeppelin và góp phần bảo mật các giao thức hàng đầu trong Web3! https://grnh.se/26c05aac3us",
  "Menu": "Menu",
  "Networks": "Mạng",
  "Languages": "Ngôn ngữ",
  "PageNotFoundTitle": "404 Lỗi - Không tìm thấy trang",
  "PageNotFoundText": "Ối! Trang bạn đang tìm kiếm không thể được tìm thấy."
}