
{
    "ethernaut": "Ethernaut",
    "title": "De Ethernaut",
    "hiring": "We zijn aan het werven!",
    "ctfRegister": "Registreer nu!",
    "ctfInfo": "<strong>We organiseren Ethernaut CTF:</strong> Een 48-uur durend Capture The Flag-evenement met prijzen en blockchain-uitdagingen, beginnend op 16/03.",
    "info": "<h2>De Ethernaut is een Web3/Solidity-gebaseerd oorlogsspel geïnspireerd door <a href='https://overthewire.org' target='_blank' rel='noopener noreferrer'>overthewire.org</a>, gespeeld in de Ethereum Virtual Machine. Elk level is een smart contract dat moet worden 'gehackt'. Het spel is 100% open source en alle levels zijn bijdragen van andere spelers. Heb je een interessant idee? PR's zijn <a href='https://github.com/OpenZeppelin/ethernaut'><button>Welkom</button></a></h2>",
    "home": "Home",
    "help": "Help",
    "stats": "Statistieken",
    "ethernautHelp": "Help",
    "footer": "ontwikkeld met <span aria-hidden='true' class='fa fa-heart' style='color: red;'></span> en <span aria-hidden='true' class='fa fa-flash' style='color: yellow;'></span> door het <a href='https://openzeppelin.com'>OpenZeppelin</a>-team",    
    "english": "English",
    "arabic": "عربي",
    "spanish": "Español",
    "portuguese": "Português",
    "japanese": "日本語",
    "turkish": "Türkçe",
    "chinese_simplified": "簡體中文",
    "chinese_traditional": "正體中文",
    "french": "Français",
    "russian": "Русский",
    "dutch": "Nederlands",
    "playNow": "Speel nu!",
    "toggleNavigation": "Navigatie wisselen",
    "levelCompleted": "Level voltooid!",
    "sources": "Bronnen",
    "submitInstance": "Instelling indienen",
    "getNewInstance": "Nieuwe instantie starten",
    "deployMessageTitle": "Spel niet gestart",
    "deprecatedNetwork": "Netwerk verouderd",
    "networkBeingDeprecated": "Netwerk wordt verouderd",
    "deployMessage": "Momenteel ondersteunt het spel alleen deze netwerken:",
    "deployConfirmation": "Wilt u de contracten op dit netwerk implementeren of overschakelen naar het Sepolia-netwerk?",
    "deployNote": "Opmerking: Als u alle levels implementeert, begeleiden we u bij het indienen van het hele geïmplementeerde spel op dit netwerk.",
    "deployGame": "Spel starten",
    "switchToSepolia": "Overschakelen naar Sepolia",
    "continueAnyway": "Toch doorgaan",
    "deployLevel": "Level starten",
    "helperDeployAllContracts": "Implementeer alle overgebleven contracten op het huidige netwerk.",
    "confirmMainnetDeploy": "U bevindt zich op een mainnet, het spel heeft geen monetaire waarde, u zou niet moeten implementeren op dit netwerk.",
    "submitLevelFooter": "Implementeer alle levels (deployAllContracts() in console) om het huidige netwerk toe te voegen aan onze <a href='https://github.com/OpenZeppelin/ethernaut'>GitHub repository</a> als een nieuw ondersteund netwerk.",
    "submitGameFooter": "Geweldig! Het hele spel is geïmplementeerd op dit netwerk. Klik hier om een GitHub-issue te openen en het naar ons te verzenden :)",
    "nextLevel": "Ga naar het volgende level",
    "uLevels": "levels",
    "lLevels": "levels",
    "refresh": "Vernieuwen",
    "uCompleted": "Voltooid",
    "lCompleted": "voltooid",
    "players": "spelers",
    "player": "Speler",
    "levelName": "level naam",
    "levelAddress": "level adres",
    "blockNum": "Blok nummer",
    "uCreated": "Gemaakt",
    "lCreated": "gemaakt",
    "instance": "Instantie",
    "numberOf": "Aantal",
    "warning": "Waarschuwing",
    "warningMessage": "Er is geen web3-provider en het spel staat in de alleen-lezen modus",
    "levelAuthor": "Auteur(s) van het level:",
    "pleaseWait": "EVEN GEDULD A.U.B.",
    "difficulty": "Moeilijkheidsgraad",
    "error": "Fout",
    "retrying": "Opnieuw proberen...",
    "typeHelpMessage": "Typ help() voor een lijst van aangepaste web3-add-ons",
    "slowNetworkMessage": "Irritant bericht 'Trage verbinding gedetecteerd'? Probeer de instellingen van de ontwikkelaarstools -> Alleen gebruikersberichten of schakel 'chrome://flags/#enable-webfonts-intervention-v2' uit",
    "notContractSetMessage": "Geen contract ingesteld, ga naar een level en klik op 'Nieuwe instantie ophalen'",
    "levelAddressMessage": "level adres",
    "instanceAddressMessage": "Instantie adres",
    "playerAddressMessage": "Speler adres",
    "selectedNetworkMessage": "Huidig netwerk: ",
    "ethernautAddressMessage": "Ethernaut adres",
    "noLevelsDataMessage": "Kan levelgegevens niet vinden",
    "ethernautNotFoundMessage": "Ethernaut contract niet gevonden in het huidige netwerk. Zorg ervoor dat (1) u metamask gebruikt, (2) dat het op een ondersteund netwerk staat, (3) dat het ontgrendeld is, (4 optioneel) Vanaf 2 november kunt u de privacymodus AAN zetten (standaard UIT) in de Metamask-instellingen als u uw informatie niet standaard wilt blootstellen. (5 optioneel) Als de privacymodus is ingeschakeld, moet u Metamask toestemming geven om deze pagina te gebruiken. en (6) vernieuw vervolgens.",
    "requestingNewInstanceMessage": "Nieuwe instantie aanvragen vanaf level...",
    "unableToRetrieveLevelMessage": "Kan level-instantie niet ophalen! Controleer de gas hoeveelheid en probeer het opnieuw.",
    "transactionNoLogsMessage": "Transactie bevat geen logs",
    "noPlayerAddressMessage": "Geen speleradres gedetecteerd! Zorg ervoor dat 1) je de Metamask-browserextensie hebt geïnstalleerd en 2) dat deze ontgrendeld is. 3 optioneel) Vanaf 2 november kunt u de privacy-modus AAN zetten (standaard UIT) in de instellingen als u uw informatie niet standaard wilt blootstellen. 4 optioneel) Als de privacy-modus is ingeschakeld, moet u Metamask toestemming geven om deze pagina te gebruiken. 5) vernieuw dan.",
    "noEthersMessage": "Oeps, je hebt geen ether! Haal wat op bij een geldige faucet voor het gekozen netwerk",
    "submitLevelMessage": "level-instantie indienen...",
    "wellDoneMessage": "Goed gedaan",
    "completedLevelMessage": "Je hebt dit level voltooid!!!",
    "uncompletedLevelMessage": "Oeps! Het lijkt erop dat je dit level nog niet hebt gekraakt",
    "metamaskKnownIssue": "Oef! Het lijkt erop dat je een bekend probleem met Metamask hebt ondervonden. Probeer je Metamask-plug-in uit te schakelen en opnieuw in te schakelen, en als dat niet werkt, moet je alle Chrome-processen afsluiten en opnieuw opstarten om het te omzeilen, totdat er een oplossing is vrijgegeven. Maak je geen zorgen, na het opnieuw opstarten zou je dit bericht nooit meer moeten zien.",
    "eventsCompletionMessage": "Fout bij het bekijken van voltooiingsevenementen:",
    "unexpectedAddressMessage": "Onverwacht adres in LevelCompletedLog-event (overslaan):",
    "helperPlayer": "huidig speleradres",
    "helperEthernaut": "hoofdcontract van het spel",
    "helperLevel": "huidig level contractadres",
    "helperContract": "huidige level contractinstantie (indien aangemaakt)",
    "helperInstance": "huidige level instantie contractadres (indien aangemaakt)",
    "helperVersion": "huidige spelversie",
    "helperGetBalance": "haalt het saldo op van het adres in ether",
    "helperGetBlockNumber": "haalt het huidige bloknummer van het netwerk op",
    "helperSendTransaction": "verzend transactiehulpprogramma",
    "helperGetNetworkId": "haalt ethereum netwerk-id op",
    "helperToWei": "converteert ether-eenheden naar wei",
    "helperFromWei": "converteert wei-eenheden naar ether",
    "levelNotTranslated": "Dit level is niet vertaald of de vertaling is onvolledig.",
    "contributeTranslation": "Klik hier om de vertaling te verbeteren",
    "usingConsole": "De meeste interactie met het spel gebeurt via de console van de browser: `Dev Tools -> Console`. Open de console en voer het commando in:\n\n`help()`\n\nom een lijst van objecten en functies te zien die door het spel naar de console zijn geïnjecteerd. Omdat de meeste interacties asynchroon zijn, raden we aan Chrome v62 te gebruiken, dat de `async/await`-keywords in de console mogelijk maakt. Zo kun je in plaats van te schrijven:\n\n`getBalance(speler)> BELOFTE`\n\n en de belofte te openen. Met await/async kun je schrijven:\n\n`await getBalance(speler) > '1.11002387' `\n\n",
    "gameMechanics": "Het spel gebruikt het hoofdcontract `Ethernaut.sol` om de voortgang van de speler te beheren en de interactie met implementaties van `Level.sol` te delegeren. Elk niveacontract geeft instanties af die spelers kunnen manipuleren, breken, vernietigen, repareren, enz. De speler vraagt een instantie aan, manipuleert deze en geeft deze terug aan het spel voor evaluatie van de leveldoorloop.\n\n Zowel het aanvragen van instanties als het indienen van instanties terug naar het spel gebeurt met de knoppen in de gebruikersinterface in elk level. Wanneer deze app een instantie van `Ethernaut.sol` ophaalt, wikkelt het deze in een `TruffleContract`-object en maakt het deze beschikbaar in de console van de browser. Zie het eerste level voor een volledige tutorial over hoe je het spel kunt spelen.",
    "beyondConsole": "Voor sommige levels is het nodig om buiten de browserconsole te werken. Dat wil zeggen, het schrijven van Solidity-code en het implementeren ervan in het netwerk om het instantiecontract van het level aan te vallen met een ander contract. Dit kan op verschillende manieren worden gedaan, bijvoorbeeld: \n\n1) Gebruik Remix om de code te schrijven en implementeer deze in het overeenkomstige netwerk. Zie [Remix Solidity IDE](https://remix.ethereum.org/). \n\n2) Stel een lokaal truffle-project in om de aanvalscontracten te ontwikkelen en te implementeren. Zie [Truffle Framework](https://trufflesuite.com/).",
    "troubleshooting": "Soms kunnen de app-status of de status van de MetaMask-plug-in een beetje verstoord raken, vooral na het overschakelen van netwerken, ontgrendelen, enzovoort. Als wat je ziet niet veel zin heeft, probeer dan de app te vernieuwen, hard te vernieuwen, je MetaMask-plug-in uit te schakelen en opnieuw in te schakelen, of zelfs je browser opnieuw te starten. \n\nAls je problemen tegenkomt, laat het ons dan weten op ethernaut@zeppelin.solutions",
    "poweredBy": "mogelijk gemaakt door ",
    "setupMetamask": "Als je het nog niet hebt, installeer dan de [MetaMask-browserextensie](https://metamask.io/) (in Chrome, Firefox, Brave of Opera op je desktopcomputer).\n\nStel de portemonnee van de extensie in en gebruik de netwerkselector om naar het gewenste netwerk te wijzen in de linkerbovenhoek van de interface van de extensie. Je kunt ook de UI-knop gebruiken om tussen netwerken te schakelen. Als je een niet-ondersteund netwerk selecteert, zal het spel je hiervan op de hoogte stellen en je naar het standaard Sepolia-testnet brengen. \n\nAls je klaar bent, kom dan hier terug en vernieuw de webpagina",
    "FifthyPercentMessage": "Fantastisch werk! Je bent halverwege Ethernaut en begint behoorlijk goed te worden in het breken van dingen. Werken als Blockchain Security Researcher bij OpenZeppelin zou leuk kunnen zijn... https://grnh.se/fdbf1c043us",
    "SeventyFivePercentMessage": "75%: Goed werk, anoniem... je zit nu diep in het konijnenhol....wie weet waar het je naartoe zal brengen... https://grnh.se/d4a786e43us",
    "NinetyPercentMessage": "90%: Je bent er bijna, anoniem! Nog maar een paar uitdagingen te gaan voordat je Ethernaut voltooit! Heb je overwogen om een carrière in Blockchain Security te beginnen? https://grnh.se/cfcca8c83us",
    "HundredPercentMessage": "100%: Gefeliciteerd! Je reis door het web3-konijnenhol is indrukwekkend en moet worden gevierd! Je hebt nu de vaardigheden om slimme contracten te breken! Wat is de volgende stap vanaf hier, anoniem? Solliciteer om een Blockchain Security Researcher te worden bij OpenZeppelin en draag bij aan het beveiligen van de belangrijkste protocollen in web3! https://grnh.se/26c05aac3us",
    "Menu": "Menu",
    "Networks": "Netwerken",
    "Languages": "Talen",
    "PageNotFoundTitle": "404 Fout - Pagina niet gevonden",
    "PageNotFoundText": "Oeps! De pagina die je zoekt kon niet worden gevonden."
}