{
  "ethernaut": "Ethernaut",
  "title": "The Ethernaut",
  "hiring": "Nous embauchons!",
  "ctfRegister": "S'inscrire maintenant!",
  "info": "<h2> L'Ethernaut est un Wargame basé sur web3 / Solidity inspiré par <a href='https://overthewire.org' target='_blank' rel='noopener noreferrer'>overthewire.org </a>, joué dans leMachine virtuelle Ethereum.Chaque niveau est un contrat intelligent qui doit être «piraté».Le jeu est 100% open source et tous les niveaux sont des contributions apportées par d'autres joueurs.Avez-vous une idée intéressante?Les PRS sont <a href='https://github.com/openzeppelin/ethernaut'><button>Bienvenue</button></a></h2>",
  "home": "Accueil",
  "help": "Aide",
  "stats": "Statistiques",
  "ethernautHelp": "Comment jouer",
  "footer": "développé avec <span aria-hidden='true' class='fa fa-heart' style='color: red;'></span> et <span aria-hidden='true' class='fa fa-flash' style='color: yellow;'></span> by the <a href='https://openzeppelin.com'>OpenZeppelin</a> team",
  "english": "English",
  "arabic": "عربي",
  "spanish": "Español",
  "portuguese": "Português",
  "japanese": "日本語",
  "turkish": "Türkçe",
  "chinese_simplified": "簡體中文",
  "chinese_traditional": "正體中文",
  "french": "Français",
  "russian": "Русский",
  "playNow": "Jouer maintenant!",
  "toggleNavigation": "Basculer la navigation",
  "levelCompleted": "Niveau terminé!",
  "sources": "Sources",
  "submitInstance": "Soumettre une instance",
  "getNewInstance": "Créer une nouvelle instance",
  "deployMessageTitle": "Jeu non déployé",
  "deprecatedNetwork": "Réseau obsolète",
  "networkBeingDeprecated": "Réseau désaffecté",
  "deployMessage": "Actuellement, le jeu ne prend en charge que ces réseaux:",
  "deployConfirmation": "Voulez-vous déployer les contrats sur ce réseau ou passer au réseau Sepolia?",
  "deployNote": "Remarque: Si vous déployez tous les niveaux, nous vous guiderons pour soumettre l'ensemble du jeu déployé sur ce réseau.",
  "deployGame": "Déploier le jeu",
  "switchToSepolia": "Passer à Sepolia",
  "continueAnyway" : "Continuer quand même",
  "deployLevel": "Déploier le niveau",
  "helperDeployAllContracts": "Déployez tous les contrats restants sur le réseau actuel.",
  "confirmMainnetDeploy": "Vous êtes sur un MainNet, le jeu n'a pas de valeur monétaire, vous ne devez pas déployer dans ce réseau.",
  "submitLevelFooter": "Déployez tous les niveaux (DeployallContracts () dans Console) pour ajouter le réseau actuel à notre <a href='https://github.com/openzeppelin/ethernaut'> Référentiel github </a> en tant que nouveau réseau pris en charge.",
  "submitGameFooter": "Impressionnant!Le jeu entier est déployé sur ce réseau.Cliquez ici pour soulever un problème de github et le soumettre :)",
  "nextLevel": "Aller au prochain niveau",
  "uLevels": "Niveaux",
  "lLevels": "niveaux",
  "refresh": "Rafraîchir",
  "uCompleted": "Terminé",
  "lCompleted": "terminé",
  "players": "joueurs",
  "player": "Joueurs",
  "levelName": "Nom du niveau",
  "levelAddress": "Adresse du niveau",
  "blockNum": "Numéro du block",
  "uCreated": "Créé",
  "lCreated": "crée",
  "instance": "Instance",
  "numberOf": "Nombre de",
  "warning": "Avertissement",
  "warningMessage": "Il n'y a pas de fournisseur Web3 et le jeu est en mode lecture seule",
  "levelAuthor": "Auteur du niveau:",
  "pleaseWait": "S'IL VOUS PLAÎT, ATTENDEZ",
  "donate": "Ce niveau vous a-t-il appris quelque chose d'utile ? Faites un don à l'auteur du niveau (sur le mainnet) :",
  "openConsole": "OUVREZ VOTRE CONSOLE POUR JOUER",
  "difficulty": "Difficulté",
  "error": "Erreur",
  "retrying": "nouvelle tentative...",
  "typeHelpMessage": "Tapez help() pour obtenir une liste des modules complémentaires personnalisés web3.",
  "slowNetworkMessage": "Message 'Slow network detected' ? Essayez les paramètres Dev Tools -> User messages only ou désactivez 'chrome://flags/#enable-webfonts-intervention-v2'",
  "notContractSetMessage": "Aucun contrat n'est défini, allez sur un niveau et cliquez sur 'Créer une nouvelle instance'.",
  "levelAddressMessage": "Adresse du niveau",
  "instanceAddressMessage": "Adresse de l'instance",
  "playerAddressMessage": "Adresse du joueur",
  "selectedNetworkMessage": "Réseau actuel: ",
  "ethernautAddressMessage": "Adresse d'Ethernaut",
  "noLevelsDataMessage": "Impossible de trouver les données du niveau",
  "ethernautNotFoundMessage": "Contrat Ethernaut non trouvé dans le réseau actuel.Veuillez vous assurer (1) que vous utilisez Metamask, (2) qu'il se trouve sur un réseau pris en charge, (3) qu'il est déverrouillé, (4 facultatif) à partir du 2 novembre, vous pouvez activer le mode de confidentialité (désactivé par défaut) dans MetamaskParamètres si vous ne souhaitez pas exposer vos informations par défaut.(5 Facultatif) Si le mode de confidentialité est activé, vous devez être autorisé Metamask à utiliser cette page.et (6) puis actualiser.",
  "requestingNewInstanceMessage": "Création d'une nouvelle instance pour le niveau...",
  "unableToRetrieveLevelMessage": "Impossible de récupérer l'instance du niveau! Veuillez vérifier la quantité de gaz et réessayer.",
  "transactionNoLogsMessage": "La transaction ne contient aucun logs",
  "noPlayerAddressMessage": "Aucune adresse de joueur détectée!Assurez-vous que 1) vous avez installé l'extension du navigateur Metamask et 2) qu'il est déverrouillé.3 Facultatif) À partir du 2 novembre, vous pouvez activer le mode de confidentialité (désactivé par défaut) dans les paramètres si vous ne souhaitez pas exposer vos informations par défaut.4 Facultatif) Si le mode de confidentialité est activé, vous devez être autorisé Metamask à utiliser cette page.5) puis actualiser.",
  "noEthersMessage": "Yikes, vous n'avez pas d'éther!Obtenez-vous dans un robinet valide pour votre réseau choisi",
  "submitLevelMessage": "Soumission de l'instance du niveau...",
  "wellDoneMessage": "Bien joué",
  "completedLevelMessage": "Vous avez terminé ce niveau!!!",
  "uncompletedLevelMessage": "Oups ! On dirait que tu n'as pas encore réussi ce niveau.",
  "metamaskKnownIssue": "Aïe ! Il semble que tu aies rencontré un problème connu de MetaMask. Essayez de désactiver et de réactiver votre extension MetaMask, et si cela ne fonctionne pas, je crains que vous ne deviez fermer tous les processus Chrome et redémarrer pour contourner le problème, jusqu'à ce qu'un correctif soit publié. Ne vous inquiétez pas, après le redémarrage, vous ne devriez plus jamais voir ce message. ",
  "eventsCompletionMessage": "Erreurs de surveillance lors de l'achèvement d'événements:",
  "unexpectedAddressMessage": "Adresse inattendue dans l'événement LevelCompletedLog (passage au suivant):",
  "helperPlayer": "adresse du joueur actuel",
  "helperEthernaut": "contract du jeu principal",
  "helperLevel": "adresse du contract du niveau actuel",
  "helperContract": "instance de contrat du niveau actuel (si créée)",
  "helperInstance": "adresse du contrat de l'instance du niveau actuel (si créée)",
  "helperVersion": "version actuelle du jeu",
  "helperGetBalance": "obtient le solde de l'adresse en éther",
  "helperGetBlockNumber": "obtient le numéro du bloc réseau actuel",
  "helperSendTransaction": "envoyer la transaction util",
  "helperGetNetworkId": "obtenir l'identifiant du réseau ethereum",
  "helperToWei": "convertir les unités ether en wei",
  "helperFromWei": "convertir les unités wei en ether",
  "levelNotTranslated": "Ce niveau n'est pas traduit ou la traduction est incomplète. ",
  "contributeTranslation": "Cliquez ici pour améliorer la traduction.",
  "usingConsole": "La plupart des interactions de jeu se font via la console du navigateur: «Dev Tools -> Console».Ouvrez la console et entrez la commande:\n\n`help () `\n\n pour voir une liste d'objets et de fonctions injectés par le jeu à la console.Étant donné que la plupart des interactions sont asynchrones, nous vous recommandons d'utiliser Chrome V62 qui permet les mots clés `async / wait` dans la console, donc au lieu d'écrire:\n\n`getBalance (lecteur)> Promise`\n\n et ouvrir la promesse.Avec Await / Async, vous pouvez écrire:\n\n`wait getBalance (joueur)> '1.11002387' `\n\n",
  "gameMechanics": "Le jeu utilise le contrat principal `Ethernaut.sol` pour gérer les progrès des joueurs et déléguer l'interaction avec les implémentations` Level.Sol`.Chaque contrat de niveau émet des instances pour les joueurs de manipuler, de casser, de détruire, de réparer, etc. Le joueur demande une instance, le manipule et le renvoie au jeu pour évaluer l'achèvement de niveau.\n\n pour demander des instances et soumettre des instances àLe jeu est réalisé avec les boutons de l'interface utilisateur à chaque niveau.Lorsque cette application récupère une instance à partir de `EtherAut.sol`, elle l'enveloppe dans un objet` TruffleContract 'et l'expose dans la console du navigateur.Voir le premier niveau pour un tutoriel complet sur la façon de jouer au jeu.",
  "beyondConsole": "Certains niveaux nécessiteront de travailler en dehors de la console du navigateur.Autrement dit, rédiger du code de Solidity et le déployer dans le réseau pour attaquer le contrat d'instance du niveau avec un autre contrat.Cela peut être fait de plusieurs manières, par exemple:\n\n1) Utilisez Remix pour écrire le code et le déployer dans le réseau correspondant voir [Remix Solidity IDE](https://remix.ethereum.org/).\n\n2) Configurer un projet de truffe local pour développer et déployer les contrats d'attaque.Voir [Truffle Framework](http://trouffleframework.com/).",
  "troubleshooting": "Parfois,\n\n (a) l'état de l'application ou (b) l'état du plugin Metamask\n\ncan devient un peu gâché, spécialement après le changement de réseaux, le déverrouillage, etc. Si ce que vous voyez n'a pas beaucoup de sens, essayez de rafraîchir l'application, de le rafraîchir durement, de désactiver et de réactiver votre plugin Metamask ou même de redémarrer votre navigateur.\n\nif Vous trouvez des problèmes, veuillez nous le faire savoir à ethernaut@zeppelin.solutions",
  "poweredBy": "créé par ",
  "setupMetamask": "Si vous ne l'avez pas déjà, installez l'extension [Metamask Browser](https://metamask.io/) (dans Chrome, Firefox, Brave ou Opera sur votre machine de bureau).\n\nEnsemble le portefeuille de l'extension et utilisez le sélecteur de réseau pour pointer vers le réseau préféré en haut à gauche de l'interface de l'extension.Vous pouvez également utiliser le bouton d'interface utilisateur pour basculer entre les réseaux.Si vous sélectionnez un réseau non pris en charge, le jeu vous informera et vous amènera au Sepolia TestNet par défaut.\n\nUne fois fait, revenez ici et rechargez la page Web",
  "FifthyPercentMessage": "Awesome work! You’re halfway through Ethernaut and getting pretty good at breaking things. Working as a Blockchain Security Researcher at OpenZeppelin could be fun... https://grnh.se/fdbf1c043us",
  "SeventyFivePercentMessage": "75%: Good work anon…you’re deep down the rabbit hole now....who knows where it will take you... https://grnh.se/d4a786e43us",
  "NinetyPercentMessage": "90%: You’re almost there anon! Just a few more challenges left until you complete Ethernaut! Have you considered a career in Blockchain Security?https://grnh.se/cfcca8c83us",
  "HundredPercentMessage": "100%: Congratulations! Your journey down the web3 rabbit hole is impressive and should be celebrated! You now have the skills to break smart contracts! What’s next from here anon? Apply to be a Blockchain Security Researcher at OpenZeppelin, and contribute to securing the top protocols in web3! https://grnh.se/26c05aac3us",
  "Menu": "Menu",
  "Networks": "Réseaux",
  "Languages": "Langues",
  "PageNotFoundTitle": "Erreur 404 - Page non trouvée",
  "PageNotFoundText": "Oups ! La page que vous recherchez est introuvable."
}
